
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 13 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;HOST&#34;]
* Update
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;host&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;name&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;password&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;port&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;user&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;USER&#34;]
* Delete
  * module.bulk-scan-db.azurerm_resource_group.data-resourcegroup
  * module.bulk-scan-staging-db.azurerm_resource_group.data-resourcegroup


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-04T10:49:27Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-DATABASE/56aa66c2301f47d5aaf825a4f0a26d67"
        name                    = "orchestrator-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-04T10:49:27Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-HOST/c845e40dcbbe4736b23dda0c2c01ab2b"
        name                    = "orchestrator-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-04T10:49:27Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-PASS/248c07685a3548918b60a5d3989f7a1f"
        name                    = "orchestrator-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-04T10:49:28Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-PORT/8e5ba2e8750f4ac3ab5bb65905e39514"
        name                    = "orchestrator-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-04T10:49:27Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-USER/a193e215b123438b9766353809f88b70"
        name                    = "orchestrator-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["host"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-04-04T10:49:28Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-staging-db-flexible-host/afbb9004c9fe4e649809f4a80241f55a"
        name                    = "orchestrator-staging-db-flexible-host"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["name"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-04-04T10:49:28Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-staging-db-flexible-name/029fee63271e4195a1680c4537c2ef13"
        name                    = "orchestrator-staging-db-flexible-name"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["password"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-04-04T10:49:28Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-staging-db-flexible-password/2c3141cf5d7e4864aed5e589017695c0"
        name                    = "orchestrator-staging-db-flexible-password"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["port"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-04-04T10:49:27Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-staging-db-flexible-port/20c151962ed6495cbc31b54f5ae4c42a"
        name                    = "orchestrator-staging-db-flexible-port"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["user"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-04-04T10:49:28Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-staging-db-flexible-user/0c5d00928e7844dcb04a5b3a66fa9a3e"
        name                    = "orchestrator-staging-db-flexible-user"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["DATABASE"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat"
      + name                    = "orchestrator-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "orchestrator PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["HOST"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat"
      + name                    = "orchestrator-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "orchestrator PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-04-04T10:49:28Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-PASS/ff808b37f73744e7a94cfb7075d26f2a"
        name                    = "orchestrator-POSTGRES-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-04-04T10:49:28Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-PORT/a825308df5b943a7805dd80f1a01ec1b"
        name                    = "orchestrator-POSTGRES-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-04-04T10:49:28Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-USER/fdc3e4d728bb499f9e0462987b47324e"
        name                    = "orchestrator-POSTGRES-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # module.bulk-scan-db.azurerm_resource_group.data-resourcegroup will be destroyed
  # (because azurerm_resource_group.data-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "data-resourcegroup" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-orchestrator-data-aat" -> null
      - location = "uksouth" -> null
      - name     = "bulk-scan-orchestrator-data-aat" -> null
      - tags     = {
          - "application"         = "bulk-scan-print"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#rbs"
          - "environment"         = "staging"
          - "managedBy"           = "Bulk Scanning and Printing"
        } -> null
    }

  # module.bulk-scan-staging-db.azurerm_resource_group.data-resourcegroup will be destroyed
  # (because azurerm_resource_group.data-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "data-resourcegroup" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-orchestrator-staging-data-aat" -> null
      - location = "uksouth" -> null
      - name     = "bulk-scan-orchestrator-staging-data-aat" -> null
      - tags     = {
          - "application"         = "bulk-scan-print"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#rbs"
          - "environment"         = "staging"
          - "managedBy"           = "Bulk Scanning and Printing"
        } -> null
    }

Plan: 2 to add, 13 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2538,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->